#ifndef SETMENU_H
#define SETMENU_H

/**
 * @class setMenu
 * @brief Класс для управления состоянием меню уровней в игре.
 *
 * Класс setMenu хранит информацию о разблокированных уровнях и уровне, на котором была поставлена пауза.
 */
class setMenu
{
public:
    bool pusklever[5]; ///< Массив, указывающий, находится ли уровень на паузе.
    bool blv[5];       ///< Массив, указывающий, разблокирован ли уровень.

    /**
     * @brief Конструктор класса setMenu.
     *
     * Инициализирует массивы pusklever и blv. Все уровни устанавливаются как не находящиеся на паузе,
     * и только первый уровень устанавливается как разблокированный.
     */
    setMenu();
};

#endif
