#include <SFML/Audio.hpp>
#ifndef SETSOUNDhpp
#define SETSOUNDhpp
using namespace sf;

/**
 * @class setSound
 * @brief Класс для управления звуковыми эффектами и музыкой в игре.
 *
 * Класс setSound загружает и управляет звуковыми эффектами и музыкой, используемыми в игре.
 * Он обеспечивает воспроизведение звуков выстрелов, смерти врагов, смерти игрока и медицинских предметов,
 * а также воспроизведение фоновоЙ музыки.
 */

class setSound
{
public:
    SoundBuffer s1; ///< Буфер звука для выстрелов.
    SoundBuffer s2; ///< Буфер звука для смерти врагов.
    SoundBuffer s3; ///< Буфер звука для смерти игрока.
    SoundBuffer s4; ///< Буфер звука для медицинских предметов.
    Sound shooting; ///< Звук выстрела.
    Sound dieenemy; ///< Звук смерти врага.
    Sound smert;    ///< Звук смерти игрока.
    Sound med;      ///< Звук медицинского предмета.
    Music music[2]; ///< Массив объектов музыки для фоновоЙ музыки.

    /**
     * @brief Конструктор класса setSound.
     *
     * Загружает звуковые файлы и настраивает буферы для различных звуковых эффектов и музыки.
     */
    setSound();
};
#endif